Revit 2024 API
IFCFile.Write Method
 Writes content to a file of IFC format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void Write(
	IFCFileWriteOptions writeOptions
)
Visual Basic
Public Sub Write ( _
	writeOptions As IFCFileWriteOptions _
)
Visual C++
public:
void Write(
	IFCFileWriteOptions^ writeOptions
)
Parameters
writeOptions
Type: Autodesk.Revit.DB.IFC.IFCFileWriteOptions
 The IFC file write options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace